tap "anomalyco/tap"
tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "rvben/rumdl"
brew "atuin"
brew "openssl@3"
brew "bat"
brew "chezmoi"
brew "lima"
brew "colima"
brew "gmp"
brew "coreutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glib"
brew "unbound"
brew "gnutls"
brew "go"
brew "go-air"
brew "gum"
brew "hyperfine"
brew "jd"
brew "jj"
brew "jq"
brew "just"
brew "lazygit"
brew "libyaml"
brew "xz"
brew "llm"
brew "mise"
brew "neovim"
brew "postgresql@14", restart_service: :changed
brew "python@3.12"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tmux"
brew "tokei"
brew "unar"
brew "uv"
brew "wget"
brew "zellij"
brew "zoxide"
brew "anomalyco/tap/opencode"
cask "codex"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty"
cask "hammerspoon"
cask "iterm2"
cask "kitty"
cask "monitorcontrol"
cask "tailscale-app"
cask "zen"
