tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

brew "bat"
brew "freetype"
brew "gettext"
brew "chezmoi"
brew "lima"
brew "colima"
brew "coreutils"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "ffmpeg"
brew "fish", args: ["HEAD"]
brew "fzf"
brew "git-delta"
brew "gitui"
brew "go"
brew "hurl"
brew "hyperfine"
brew "ispell"
brew "jq"
brew "llm"
brew "mise"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "ollama"
brew "postgresql@14", restart_service: true
brew "qemu"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "starship"
brew "tokei"
brew "uv"
brew "wget"
brew "zig"
brew "zls"
brew "zoxide"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-dbus", "with-emacs-icons-project-EmacsIcon7", "with-mac-metal", "with-native-comp", "with-starter", "with-xwidgets"]
cask "font-fira-code"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono"
cask "wezterm"
cask "ghostty"
cask "iterm2"
cask "hammerspoon"
